Revit 2027 API
ExporterIFCUtils.GetDoor2DArcsFromFamily Method
 Gets the arcs associated with the plan view of a door.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Arc> GetDoor2DArcsFromFamily(
	Family pFam
)
Public Shared Function GetDoor2DArcsFromFamily (
	pFam As Family
) As IList(Of Arc)
public:
static IList<Arc^>^ GetDoor2DArcsFromFamily(
	Family^ pFam
)
static member GetDoor2DArcsFromFamily :
        pFam : Family -> IList<Arc>
Parameters
pFam Family
 The family.
Return Value
IList<Arc>
 The arcs.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace